ademeyer/zephyr-project/modules/stm32f746_disco_sai/i2s_sai_ll_stm32.c

/*
 * Copyright (c) 2018 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_sai

#include <string.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/i2s.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <soc.h>
#include <stm32_ll_rcc.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/cache.h>
#include <zephyr/logging/log.h>
#include <zephyr/irq.h>
#include "i2s_sai_ll_stm32.h"

LOG_MODULE_REGISTER(i2s_sai_ll_stm32);

static bool queue_is_empty(struct k_msgq *q)
{
  return (k_msgq_num_used_get(q) == 0) ? true : false;
}

/*
 * Get data from the queue
 */
static int queue_get(struct k_msgq *q, void **mem_block, size_t *size, int32_t timeout)
{
  struct queue_item item;
  int result = k_msgq_get(q, &item, SYS_TIMEOUT_MS(timeout));

  if (result == 0)
  {
    *mem_block = item.mem_block;
    *size = item.size;
  }
  return result;
}

/*
 * Put data in the queue
 */
static int queue_put(struct k_msgq *q, void *mem_block, size_t size, int32_t timeout)
{
  struct queue_item item = {.mem_block = mem_block, .size = size};

  return k_msgq_put(q, &item, SYS_TIMEOUT_MS(timeout));
}

static void stream_queue_drop(struct stream *s)
{
  size_t size;
  void *mem_block;

  while (queue_get(s->msgq, &mem_block, &size, 0) == 0)
  {
    k_mem_slab_free(s->cfg.mem_slab, mem_block);
  }
}

static int i2s_stm32_enable_clock(const struct device *dev)
{
  const struct i2s_sai_stm32_cfg *cfg = dev->config;
  const struct device *clk;
  int ret;

  clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

  if (!device_is_ready(clk))
  {
    LOG_ERR("clock control device not ready");
    return -ENODEV;
  }

  ret = clock_control_on(clk, (clock_control_subsys_t)&cfg->pclken[0]);
  if (ret != 0)
  {
    LOG_ERR("Could not enable I2S clock");
    return -EIO;
  }

  if (cfg->pclk_len > 1)
  {
    /* Enable I2S clock source */
    ret = clock_control_configure(clk, (clock_control_subsys_t)&cfg->pclken[1], NULL);
    if (ret < 0)
    {
      LOG_ERR("Could not configure I2S domain clock");
      return -EIO;
    }
  }

  return 0;
}

static int i2s_stm32_get_clock(const struct device *dev, uint32_t *sai_clk_freq)
{
  const struct i2s_sai_stm32_cfg *cfg = dev->config;

  if (cfg->pclk_len > 1)
  {
    /* Handle multiple clock sources */
    if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
                               (clock_control_subsys_t)&cfg->pclken[1],
                               sai_clk_freq) < 0)
    {
      LOG_ERR("Failed call clock_control_get_rate(pclken[1])");
      return -EIO;
    }
  }
  else
  {
    /* Handle single clock source */
    if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
                               (clock_control_subsys_t)&cfg->pclken[0],
                               sai_clk_freq) < 0)
    {
      LOG_ERR("Failed call clock_control_get_rate(pclken[0])");
      return -EIO;
    }
  }

  return 0;
}

static int i2s_sai_stm32_configure(const struct device *dev, enum i2s_dir dir,
                                   const struct i2s_config *i2s_cfg)
{
  struct i2s_sai_stm32_data *const dev_data = dev->data;
  const struct i2s_sai_stm32_cfg *const cfg = dev->config;
  struct stream *stream;
  uint32_t num_slot;
  uint32_t protocol;
  int ret;

  /*
   * Detertermine the audio mode:
   * Mode master tx
   * Mode slave tx
   * Mode master rx
   * Mode slave rx
   */

  /* Set audio mode (master or slave) */
  bool is_master = true;
  if (i2s_cfg->options & I2S_OPT_FRAME_CLK_SLAVE ||
      i2s_cfg->options & I2S_OPT_BIT_CLK_SLAVE)
  {
    is_master = false;
  }

  /* Data direction: tx or rx role*/
  if (dir == I2S_DIR_RX)
  {
    stream = &dev_data->rx;
  }
  else if (dir == I2S_DIR_TX)
  {
    stream = &dev_data->tx;
  }
  else if (dir == I2S_DIR_BOTH)
  {
    return -ENOSYS;
  }
  else
  {
    LOG_ERR("Either RX or TX direction must be selected");
    return -EINVAL;
  }
  stream->master = is_master;

  if (stream->state != I2S_STATE_NOT_READY && stream->state != I2S_STATE_READY)
  {
    LOG_ERR("invalid state");
    return -EINVAL;
  }

  if (i2s_cfg->frame_clk_freq == 0U)
  {
    stream_queue_drop(stream);
    memset(&stream->cfg, 0, sizeof(struct i2s_config));
    stream->state = I2S_STATE_NOT_READY;
    return 0;
  }

  memcpy(&stream->cfg, i2s_cfg, sizeof(struct i2s_config));

  /* Configure SAI role*/
  uint32_t a_mode = 0;
  if (is_master && dir == I2S_DIR_TX)
  {
    a_mode = SAI_MODEMASTER_TX;
  }
  else if (!is_master && dir == I2S_DIR_TX)
  {
    a_mode = SAI_MODESLAVE_TX;
  }
  else if (is_master && dir == I2S_DIR_RX)
  {
    a_mode = SAI_MODEMASTER_RX;
  }
  else if (!is_master && dir == I2S_DIR_RX)
  {
    a_mode = SAI_MODESLAVE_RX;
  }
  else
  {
    LOG_ERR("Undefine audio mode for SAI");
    return -EINVAL;
  }

  /* Configure SAI supported datasize */
  uint32_t datasize = 0;
  switch (i2s_cfg->word_size)
  {
  case 16U:
    datasize = SAI_PROTOCOL_DATASIZE_16BIT;
    break;
  case 24U:
    datasize = SAI_PROTOCOL_DATASIZE_24BIT;
    break;
  case 32U:
    datasize = SAI_PROTOCOL_DATASIZE_32BIT;
    break;
  default:
    break;
  }

  /* Configure SAI supported sample rate / audio frequency */
  uint32_t a_frequency = i2s_cfg->frame_clk_freq;

  /* Configure number of slot / channel */
  num_slot = ((i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK) == I2S_FMT_DATA_FORMAT_I2S)
                 ? 2U
                 : i2s_cfg->channels;

  /* Set I2S Standard */
  switch (i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK)
  {
  case I2S_FMT_DATA_FORMAT_I2S:
    protocol = SAI_I2S_STANDARD;
    break;

  case I2S_FMT_DATA_FORMAT_PCM_SHORT:
    protocol = SAI_PCM_SHORT;
    break;

  case I2S_FMT_DATA_FORMAT_PCM_LONG:
    protocol = SAI_PCM_LONG;
    break;

  case I2S_FMT_DATA_FORMAT_LEFT_JUSTIFIED:
    protocol = SAI_I2S_MSBJUSTIFIED;
    break;

  case I2S_FMT_DATA_FORMAT_RIGHT_JUSTIFIED:
    protocol = SAI_I2S_LSBJUSTIFIED;
    break;

  default:
    LOG_ERR("Unsupported I2S data format");
    return -EINVAL;
  }

  /* set I2S clock strobing / clock polarity */
  uint32_t clk_strobing;
  if ((i2s_cfg->format & I2S_FMT_CLK_FORMAT_MASK) == I2S_FMT_BIT_CLK_INV)
  {
    clk_strobing = SAI_CLOCKSTROBING_RISINGEDGE;
  }
  else
  {
    clk_strobing = SAI_CLOCKSTROBING_FALLINGEDGE;
  }

  /* Get PLLSAI clock */
  uint32_t clk;
  ret = i2s_stm32_get_clock(dev, &clk);
  if (ret != 0)
  {
    LOG_ERR("Unable to get SAI clock");
    return -EINVAL;
  }

  /* Configure SAI subsystem */
  ret = LL_sai_init_ll_subsystem(cfg->i2s, protocol, datasize, a_mode, a_frequency, num_slot,
                                 clk_strobing, clk);
  if (ret != 0)
  {
    LOG_ERR("SAI LL I2S configuration failed");
    return -ENOSYS;
  }
  return 0;
}

static int i2s_sai_stm32_trigger(const struct device *dev, enum i2s_dir dir,
                                 enum i2s_trigger_cmd cmd)
{
  struct i2s_sai_stm32_data *const dev_data = dev->data;
  const struct i2s_sai_stm32_cfg *const cfg = dev->config;
  struct stream *stream;
  unsigned int key;
  int ret;

  if (dir == I2S_DIR_RX)
  {
    stream = &dev_data->rx;
  }
  else if (dir == I2S_DIR_TX)
  {
    stream = &dev_data->tx;
  }
  else if (dir == I2S_DIR_BOTH)
  {
    return -ENOSYS;
  }
  else
  {
    LOG_ERR("Either RX or TX direction must be selected");
    return -EINVAL;
  }

