ademeyer/zephyr-project/modules/stm32f746_disco_sai/i2s_sai_ll_stm32.c
  switch (cmd)
  {
  case I2S_TRIGGER_START:
    if (stream->state != I2S_STATE_READY)
    {
      LOG_ERR("START trigger: invalid state %d", stream->state);
      return -EIO;
    }

    __ASSERT_NO_MSG(stream->mem_block == NULL);

    ret = stream->stream_start(stream, dev);
    if (ret < 0)
    {
      LOG_ERR("START trigger failed %d", ret);
      return ret;
    }

    stream->state = I2S_STATE_RUNNING;
    stream->last_block = false;
    break;

  case I2S_TRIGGER_STOP:
    key = irq_lock();
    if (stream->state != I2S_STATE_RUNNING)
    {
      irq_unlock(key);
      LOG_ERR("STOP trigger: invalid state");
      return -EIO;
    }
  do_trigger_stop:
    if (ll_func_i2s_dma_busy(cfg->i2s))
    {
      stream->state = I2S_STATE_STOPPING;
      /*
       * Indicate that the transition to I2S_STATE_STOPPING
       * is triggered by STOP command
       */
      stream->tx_stop_for_drain = false;
    }
    else
    {
      stream->stream_disable(stream, dev);
      stream->state = I2S_STATE_READY;
      stream->last_block = true;
    }
    irq_unlock(key);
    break;

  case I2S_TRIGGER_DRAIN:
    key = irq_lock();
    if (stream->state != I2S_STATE_RUNNING)
    {
      irq_unlock(key);
      LOG_ERR("DRAIN trigger: invalid state");
      return -EIO;
    }

    if (dir == I2S_DIR_TX)
    {
      if ((queue_is_empty(stream->msgq) == false) ||
          (ll_func_i2s_dma_busy(cfg->i2s)))
      {
        stream->state = I2S_STATE_STOPPING;
        /*
         * Indicate that the transition to I2S_STATE_STOPPING
         * is triggered by DRAIN command
         */
        stream->tx_stop_for_drain = true;
      }
      else
      {
        stream->stream_disable(stream, dev);
        stream->state = I2S_STATE_READY;
      }
    }
    else if (dir == I2S_DIR_RX)
    {
      goto do_trigger_stop;
    }
    else
    {
      LOG_ERR("Unavailable direction");
      return -EINVAL;
    }
    irq_unlock(key);
    break;

  case I2S_TRIGGER_DROP:
    if (stream->state == I2S_STATE_NOT_READY)
    {
      LOG_ERR("DROP trigger: invalid state");
      return -EIO;
    }
    stream->stream_disable(stream, dev);
    stream_queue_drop(stream);
    stream->state = I2S_STATE_READY;
    break;

  case I2S_TRIGGER_PREPARE:
    if (stream->state != I2S_STATE_ERROR)
    {
      LOG_ERR("PREPARE trigger: invalid state");
      return -EIO;
    }
    stream->state = I2S_STATE_READY;
    stream_queue_drop(stream);
    break;

  default:
    LOG_ERR("Unsupported trigger command");
    return -EINVAL;
  }

  return 0;
}

static int i2s_sai_stm32_read(const struct device *dev, void **mem_block, size_t *size)
{
  struct i2s_sai_stm32_data *const dev_data = dev->data;
  int ret;

  if (dev_data->rx.state == I2S_STATE_NOT_READY)
  {
    LOG_DBG("invalid state");
    return -EIO;
  }

  /* Get data from the beginning of RX queue */
  ret = queue_get(dev_data->rx.msgq, mem_block, size, dev_data->rx.cfg.timeout);
  if (ret < 0)
  {
    return -EIO;
  }

  return 0;
}

static int i2s_sai_stm32_write(const struct device *dev, void *mem_block, size_t size)
{
  struct i2s_sai_stm32_data *const dev_data = dev->data;

  if (dev_data->tx.state != I2S_STATE_RUNNING && dev_data->tx.state != I2S_STATE_READY)
  {
    LOG_DBG("invalid state");
    return -EIO;
  }

  /* Add data to the end of the TX queue */
  return queue_put(dev_data->tx.msgq, mem_block, size, dev_data->tx.cfg.timeout);
}

static DEVICE_API(i2s, i2s_sai_stm32_driver_api) = {
    .configure = i2s_sai_stm32_configure,
    .read = i2s_sai_stm32_read,
    .write = i2s_sai_stm32_write,
    .trigger = i2s_sai_stm32_trigger,
};

#define STM32_DMA_NUM_CHANNELS 8
static const struct device *active_dma_rx_channel[STM32_DMA_NUM_CHANNELS];
static const struct device *active_dma_tx_channel[STM32_DMA_NUM_CHANNELS];

static int reload_dma(const struct device *dev_dma, uint32_t channel, struct dma_config *dcfg,
                      void *src, void *dst, uint32_t blk_size)
{
  int ret;

  ret = dma_reload(dev_dma, channel, (uint32_t)src, (uint32_t)dst, blk_size);
  if (ret < 0)
  {
    return ret;
  }

  ret = dma_start(dev_dma, channel);

  return ret;
}

static int start_dma(const struct device *dev_dma, uint32_t channel, struct dma_config *dcfg,
                     void *src, bool src_addr_increment, void *dst, bool dst_addr_increment,
                     uint8_t fifo_threshold, uint32_t blk_size)
{
  struct dma_block_config blk_cfg;
  int ret;

  memset(&blk_cfg, 0, sizeof(blk_cfg));
  blk_cfg.block_size = blk_size;
  blk_cfg.source_address = (uint32_t)src;
  blk_cfg.dest_address = (uint32_t)dst;
  if (src_addr_increment)
  {
    blk_cfg.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
  }
  else
  {
    blk_cfg.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
  }
  if (dst_addr_increment)
  {
    blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
  }
  else
  {
    blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
  }
  blk_cfg.fifo_mode_control = fifo_threshold;

  dcfg->head_block = &blk_cfg;

  ret = dma_config(dev_dma, channel, dcfg);
  if (ret < 0)
  {
    return ret;
  }

  ret = dma_start(dev_dma, channel);

  return ret;
}

static const struct device *get_dev_from_rx_dma_channel(uint32_t dma_channel);
static const struct device *get_dev_from_tx_dma_channel(uint32_t dma_channel);
static void rx_stream_disable(struct stream *stream, const struct device *dev);
static void tx_stream_disable(struct stream *stream, const struct device *dev);

/* This function is executed in the interrupt context */
static void dma_rx_callback(const struct device *dma_dev, void *arg, uint32_t channel, int status)
{
  const struct device *dev = get_dev_from_rx_dma_channel(channel);
  const struct i2s_sai_stm32_cfg *cfg = dev->config;
  struct i2s_sai_stm32_data *const dev_data = dev->data;
  struct stream *stream = &dev_data->rx;
  void *mblk_tmp;
  int ret;

  if (status < 0)
  {
    ret = -EIO;
    stream->state = I2S_STATE_ERROR;
    goto rx_disable;
  }

  __ASSERT_NO_MSG(stream->mem_block != NULL);

  /* Stop reception if there was an error */
  if (stream->state == I2S_STATE_ERROR)
  {
    goto rx_disable;
  }

  mblk_tmp = stream->mem_block;

