ademeyer/zephyr-project/modules/stm32f746_disco_sai/i2s_sai_ll_stm32.c
  /* Prepare to receive the next data block */
  ret = k_mem_slab_alloc(stream->cfg.mem_slab, &stream->mem_block, K_NO_WAIT);
  if (ret < 0)
  {
    stream->state = I2S_STATE_ERROR;
    goto rx_disable;
  }

  ret = reload_dma(stream->dev_dma, stream->dma_channel, &stream->dma_cfg,
                   (void *)LL_sai_get_register_ll_subsystem(cfg->i2s), stream->mem_block,
                   stream->cfg.block_size);
  if (ret < 0)
  {
    LOG_DBG("Failed to start RX DMA transfer: %d", ret);
    goto rx_disable;
  }

  /* Assure cache coherency after DMA write operation */
  sys_cache_data_invd_range(mblk_tmp, stream->cfg.block_size);

  /* All block data received */
  ret = queue_put(stream->msgq, mblk_tmp, stream->cfg.block_size, 0);
  if (ret < 0)
  {
    stream->state = I2S_STATE_ERROR;
    goto rx_disable;
  }

  /* Stop reception if we were requested */
  if (stream->state == I2S_STATE_STOPPING)
  {
    stream->state = I2S_STATE_READY;
    goto rx_disable;
  }

  return;

rx_disable:
  rx_stream_disable(stream, dev);
}

static void dma_tx_callback(const struct device *dma_dev, void *arg, uint32_t channel, int status)
{
  const struct device *dev = get_dev_from_tx_dma_channel(channel);
  const struct i2s_sai_stm32_cfg *cfg = dev->config;
  struct i2s_sai_stm32_data *const dev_data = dev->data;
  struct stream *stream = &dev_data->tx;
  size_t mem_block_size;
  int ret;

  if (status < 0)
  {
    ret = -EIO;
    stream->state = I2S_STATE_ERROR;
    goto tx_disable;
  }

  __ASSERT_NO_MSG(stream->mem_block != NULL);

  /* All block data sent */
  k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
  stream->mem_block = NULL;

  /* Stop transmission if there was an error */
  if (stream->state == I2S_STATE_ERROR)
  {
    LOG_ERR("TX error detected");
    goto tx_disable;
  }

  /* Check if we finished transferring one block and stopping is requested */
  if ((stream->state == I2S_STATE_STOPPING) && (status == DMA_STATUS_COMPLETE))
  {
    /*
     * Check if all tx samples have been completely handled
     * as stated in zephyr i2s specification, in case of DRAIN command
     * send all data in the transmit queue and stop the transmission.
     */
    if (queue_is_empty(stream->msgq) == true)
    {
      stream_queue_drop(stream);
      stream->state = I2S_STATE_READY;
      goto tx_disable;
    }
    else if (stream->tx_stop_for_drain == false)
    {
      /*
       * In case of STOP command, just stop the transmission
       * at the current. The transmission can be resumed.
       */
      stream->state = I2S_STATE_READY;
      goto tx_disable;
    }
    /* else: DRAIN trigger -> continue TX normally until queue is empty */
  }

  /* Stop transmission if we were requested */
  if (stream->last_block)
  {
    stream->state = I2S_STATE_READY;
    goto tx_disable;
  }

  /* Prepare to send the next data block */
  ret = queue_get(stream->msgq, &stream->mem_block, &mem_block_size, 0);
  if (ret < 0)
  {
    if (stream->state == I2S_STATE_STOPPING)
    {
      stream->state = I2S_STATE_READY;
    }
    else
    {
      stream->state = I2S_STATE_ERROR;
    }
    goto tx_disable;
  }

  /* Assure cache coherency before DMA read operation */
  sys_cache_data_flush_range(stream->mem_block, mem_block_size);

  ret = reload_dma(stream->dev_dma, stream->dma_channel, &stream->dma_cfg, stream->mem_block,
                   // #if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_i2s)
                   (void *)LL_sai_get_register_ll_subsystem(cfg->i2s), mem_block_size);
  if (ret < 0)
  {
    LOG_DBG("Failed to start TX DMA transfer: %d", ret);
    goto tx_disable;
  }

  return;

tx_disable:
  tx_stream_disable(stream, dev);
}

static uint32_t i2s_stm32_irq_count;
static uint32_t i2s_stm32_irq_ovr_count;
static uint32_t i2s_stm32_irq_udr_count;

static void i2s_stm32_isr(const struct device *dev)
{
  const struct i2s_sai_stm32_cfg *cfg = dev->config;

  /* NOTE: UDR error must be explicitly cleared on STM32H7 */
  if (LL_sai_get_OVRUDR_ll_subsystem(cfg->i2s))
  {
    i2s_stm32_irq_udr_count++;
    LL_sai_clear_OVRUDR_ll_subsystem(cfg->i2s);
  }

  i2s_stm32_irq_count++;
}

static int i2s_stm32_initialize(const struct device *dev)
{
  const struct i2s_sai_stm32_cfg *cfg = dev->config;
  struct i2s_sai_stm32_data *const dev_data = dev->data;
  struct stream *stream = &dev_data->tx;
  int ret, i;

  /* Initialize the variable used to handle the TX */
  stream->tx_stop_for_drain = false;

  /* Enable I2S clock propagation */
  ret = i2s_stm32_enable_clock(dev);
  if (ret < 0)
  {
    LOG_ERR("%s: clock enabling failed: %d", __func__, ret);
    return -EIO;
  }

  /* Configure dt provided device signals when available */
  ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
  if (ret < 0)
  {
    LOG_ERR("I2S pinctrl setup failed (%d)", ret);
    return ret;
  }

  cfg->irq_config(dev);

  for (i = 0; i < STM32_DMA_NUM_CHANNELS; i++)
  {
    active_dma_rx_channel[i] = NULL;
    active_dma_tx_channel[i] = NULL;
  }

  /* Get the binding to the DMA device */
  if (!device_is_ready(dev_data->tx.dev_dma))
  {
    LOG_ERR("%s device not ready", dev_data->tx.dev_dma->name);
    return -ENODEV;
  }
  if (!device_is_ready(dev_data->rx.dev_dma))
  {
    LOG_ERR("%s device not ready", dev_data->rx.dev_dma->name);
    return -ENODEV;
  }

  LOG_INF("%s inited", dev->name);

  return 0;
}

static int rx_stream_start(struct stream *stream, const struct device *dev)
{
  const struct i2s_sai_stm32_cfg *cfg = dev->config;
  int ret;

  ret = k_mem_slab_alloc(stream->cfg.mem_slab, &stream->mem_block, K_NO_WAIT);
  if (ret < 0)
  {
    return ret;
  }

  if (stream->master)
  {
    LL_sai_set_transfer_mode_ll_subsystem(cfg->i2s, SAI_MODEMASTER_RX);
  }
  else
  {
    LL_sai_set_transfer_mode_ll_subsystem(cfg->i2s, SAI_MODEMASTER_RX);
  }

  /* remember active RX DMA channel (used in callback) */
  active_dma_rx_channel[stream->dma_channel] = dev;

  ret = start_dma(stream->dev_dma, stream->dma_channel, &stream->dma_cfg,
                  (void *)LL_sai_get_register_ll_subsystem(cfg->i2s),
                  stream->src_addr_increment, stream->mem_block, stream->dst_addr_increment,
                  stream->fifo_threshold, stream->cfg.block_size);
  if (ret < 0)
  {
    LOG_ERR("Failed to start RX DMA transfer: %d", ret);
    return ret;
  }

