ademeyer/zephyr-project/modules/stm32f746_disco_sai/i2s_sai_ll_stm32.c
  /* Enable SAI DMA */
  LL_sai_dma_resume_ll_subsystem(cfg->i2s);

  /* Enable SAI ISR Event */
  LL_sai_enable_OVRUDR_ll_subsystem(cfg->i2s);
  LL_sai_enable_FREQ_ll_subsystem(cfg->i2s);
  LL_sai_enable_ll_subsystem(cfg->i2s);

  return 0;
}

static int tx_stream_start(struct stream *stream, const struct device *dev)
{
  const struct i2s_sai_stm32_cfg *cfg = dev->config;
  size_t mem_block_size;
  int ret;

  ret = queue_get(stream->msgq, &stream->mem_block, &mem_block_size, 0);
  if (ret < 0)
  {
    return ret;
  }

  /* Assure cache coherency before DMA read operation */
  sys_cache_data_flush_range(stream->mem_block, mem_block_size);

  if (stream->master)
  {
    LL_sai_set_transfer_mode_ll_subsystem(cfg->i2s, SAI_MODEMASTER_TX);
  }
  else
  {
    LL_sai_set_transfer_mode_ll_subsystem(cfg->i2s, SAI_MODESLAVE_TX);
  }

  /* remember active TX DMA channel (used in callback) */
  active_dma_tx_channel[stream->dma_channel] = dev;

  ret = start_dma(stream->dev_dma, stream->dma_channel, &stream->dma_cfg, stream->mem_block,
                  stream->src_addr_increment,
                  (void *)LL_sai_get_register_ll_subsystem(cfg->i2s),
                  stream->dst_addr_increment, stream->fifo_threshold, stream->cfg.block_size);

  if (ret < 0)
  {
    LOG_ERR("Failed to start TX DMA transfer: %d", ret);
    return ret;
  }

  /* Enable SAI DMA */
  LL_sai_dma_resume_ll_subsystem(cfg->i2s);

  /* Enable SAI ISR Event */
  LL_sai_enable_OVRUDR_ll_subsystem(cfg->i2s);
  LL_sai_enable_FREQ_ll_subsystem(cfg->i2s);
  LL_sai_enable_ll_subsystem(cfg->i2s);

  return 0;
}

static void rx_stream_disable(struct stream *stream, const struct device *dev)
{
  const struct i2s_sai_stm32_cfg *cfg = dev->config;

  /* Disable SAI DMR RX */
  LL_sai_dma_abort_ll_subsystem(cfg->i2s);
  /* Disable SAI ISR Event */
  LL_sai_disable_OVRUDR_ll_subsystem(cfg->i2s);
  LL_sai_disable_FREQ_ll_subsystem(cfg->i2s);

  dma_stop(stream->dev_dma, stream->dma_channel);
  if (stream->mem_block != NULL)
  {
    k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
    stream->mem_block = NULL;
  }

  LL_sai_disable_ll_subsystem(cfg->i2s);

  active_dma_rx_channel[stream->dma_channel] = NULL;
}

static void tx_stream_disable(struct stream *stream, const struct device *dev)
{
  const struct i2s_sai_stm32_cfg *cfg = dev->config;

  /* Disable SAI DMR TX */
  LL_sai_dma_abort_ll_subsystem(cfg->i2s);
  /* Disable SAI ISR Event */
  LL_sai_disable_OVRUDR_ll_subsystem(cfg->i2s);
  LL_sai_disable_FREQ_ll_subsystem(cfg->i2s);

  dma_stop(stream->dev_dma, stream->dma_channel);
  if (stream->mem_block != NULL)
  {
    k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
    stream->mem_block = NULL;
  }

  /* Wait for TX queue to drain before disabling */
  k_busy_wait(100);
  LL_sai_disable_ll_subsystem(cfg->i2s);

  active_dma_tx_channel[stream->dma_channel] = NULL;
}

static const struct device *get_dev_from_rx_dma_channel(uint32_t dma_channel)
{
  return active_dma_rx_channel[dma_channel];
}

static const struct device *get_dev_from_tx_dma_channel(uint32_t dma_channel)
{
  return active_dma_tx_channel[dma_channel];
}

/* src_dev and dest_dev should be 'MEMORY' or 'PERIPHERAL'. */
#define I2S_DMA_CHANNEL_INIT(index, dir, dir_cap, src_dev, dest_dev)         \
  .dir = {                                                                   \
      .dev_dma = DEVICE_DT_GET(STM32_DMA_CTLR(index, dir)),                  \
      .dma_channel = DT_INST_DMAS_CELL_BY_NAME(index, dir, channel),         \
      .dma_cfg =                                                             \
          {                                                                  \
              .block_count = 2,                                              \
              .dma_slot = STM32_DMA_SLOT(index, dir, slot),                  \
              .channel_direction = src_dev##_TO_##dest_dev,                  \
              .source_data_size = 2,    /* 16bit default */                  \
              .dest_data_size = 2,      /* 16bit default */                  \
              .source_burst_length = 1, /* SINGLE transfer */                \
              .dest_burst_length = 1,                                        \
              .channel_priority = STM32_DMA_CONFIG_PRIORITY(                 \
                  STM32_DMA_CHANNEL_CONFIG(index, dir)),                     \
              .dma_callback = dma_##dir##_callback,                          \
          },                                                                 \
      .src_addr_increment = STM32_DMA_CONFIG_##src_dev##_ADDR_INC(           \
          STM32_DMA_CHANNEL_CONFIG(index, dir)),                             \
      .dst_addr_increment = STM32_DMA_CONFIG_##dest_dev##_ADDR_INC(          \
          STM32_DMA_CHANNEL_CONFIG(index, dir)),                             \
      .fifo_threshold =                                                      \
          STM32_DMA_FEATURES_FIFO_THRESHOLD(STM32_DMA_FEATURES(index, dir)), \
      .stream_start = dir##_stream_start,                                    \
      .stream_disable = dir##_stream_disable,                                \
      .msgq = &dir##_##index##_queue,                                        \
  }

#define I2S_SAI_STM32_INIT(index)                                                               \
                                                                                                \
  static void i2s_stm32_irq_config_func_##index(const struct device *dev);                      \
                                                                                                \
  PINCTRL_DT_INST_DEFINE(index);                                                                \
                                                                                                \
  static const struct stm32_pclken clk_##index[] = STM32_DT_INST_CLOCKS(index);                 \
                                                                                                \
  static const struct i2s_sai_stm32_cfg i2s_stm32_config_##index = {                            \
      .i2s = (SAI_TypeDef *)DT_INST_REG_ADDR(index),                                            \
      .pclken = clk_##index,                                                                    \
      .pclk_len = DT_INST_NUM_CLOCKS(index),                                                    \
      .pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                            \
      .irq_config = i2s_stm32_irq_config_func_##index,                                          \
      .master_clk_sel = DT_INST_PROP(index, mck_enabled)};                                      \
                                                                                                \
  K_MSGQ_DEFINE(rx_##index##_queue, sizeof(struct queue_item),                                  \
                CONFIG_SAI_STM32_RX_BLOCK_COUNT, 4);                                            \
  K_MSGQ_DEFINE(tx_##index##_queue, sizeof(struct queue_item),                                  \
                CONFIG_SAI_STM32_TX_BLOCK_COUNT, 4);                                            \
                                                                                                \
  static struct i2s_sai_stm32_data i2s_stm32_data_##index = {                                   \
      UTIL_AND(DT_INST_DMAS_HAS_NAME(index, rx),                                                \
               I2S_DMA_CHANNEL_INIT(index, rx, RX, PERIPHERAL, MEMORY)),                        \
      UTIL_AND(DT_INST_DMAS_HAS_NAME(index, tx),                                                \
               I2S_DMA_CHANNEL_INIT(index, tx, TX, MEMORY, PERIPHERAL)),                        \
  };                                                                                            \
  DEVICE_DT_INST_DEFINE(index, &i2s_stm32_initialize, NULL, &i2s_stm32_data_##index,            \
                        &i2s_stm32_config_##index, POST_KERNEL, 4 /*CONFIG_I2S_INIT_PRIORITY*/, \
                        &i2s_sai_stm32_driver_api);                                             \
                                                                                                \
  static void i2s_stm32_irq_config_func_##index(const struct device *dev)                       \
  {                                                                                             \
    IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority), i2s_stm32_isr,               \
                DEVICE_DT_INST_GET(index), 0);                                                  \
    irq_enable(DT_INST_IRQN(index));                                                            \
  }

DT_INST_FOREACH_STATUS_OKAY(I2S_SAI_STM32_INIT)
